### 데이터프레임의 데이터 조작

In [2]:
import numpy as np
import pandas as pd

#### 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
s.count()

9

In [6]:
np.random.seed(2020)
df = pd.DataFrame(np.random.randint(5, size = (4, 4)), dtype = float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
2  0.0  0.0  2.0  NaN
3  3.0  3.0  2.0  3.0

In [7]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [3]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

#### 카테고리 값 세기

In [12]:
np.random.seed(2020)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    5
96    5
97    5
98    2
99    2
dtype: int32

In [14]:
s2.value_counts()

0    20
3    18
2    17
1    17
5    16
4    12
dtype: int64

In [15]:
df

     0    1    2    3
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
2  0.0  0.0  2.0  NaN
3  3.0  3.0  2.0  3.0

In [16]:
df[0].value_counts()

3.0    2
0.0    2
Name: 0, dtype: int64

#### 정렬

In [18]:
s2

0     0
1     0
2     3
3     3
4     3
     ..
95    5
96    5
97    5
98    2
99    2
Length: 100, dtype: int32

In [20]:
s2.value_counts().sort_index()

0    20
1    17
2    17
3    18
4    12
5    16
dtype: int64

In [23]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [21]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [22]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [24]:
df

     0    1    2    3
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
2  0.0  0.0  2.0  NaN
3  3.0  3.0  2.0  3.0

In [26]:
df.sort_values(by = 1)

     0    1    2    3
0  0.0  0.0  3.0  3.0
2  0.0  0.0  2.0  NaN
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

In [27]:
df.sort_values(by = [1, 2])

     0    1    2    3
2  0.0  0.0  2.0  NaN
0  0.0  0.0  3.0  3.0
1  3.0  3.0  0.0  0.0
3  3.0  3.0  2.0  3.0

In [36]:
# 연습문제
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [37]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [38]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [39]:
titanic['age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [40]:
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

#### 행/열 합계

In [42]:
np.random.seed(2020)
df2 = pd.DataFrame(np.random.randint(10,size = (4,8)))
df2

   0  1  2  3  4  5  6  7
0  0  8  3  6  3  3  7  8
1  0  0  8  9  3  7  2  3
2  6  5  0  4  8  6  4  1
3  1  5  9  5  6  6  6  5

In [43]:
df2.sum(axis = 1)

0    38
1    32
2    34
3    43
dtype: int64

In [44]:
df2.sum(axis = 0)

0     7
1    18
2    20
3    24
4    20
5    22
6    19
7    17
dtype: int64

In [47]:
df2['RowSum'] = df2.sum(axis = 1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  0  8  3  6  3  3  7  8     114
1  0  0  8  9  3  7  2  3      96
2  6  5  0  4  8  6  4  1     102
3  1  5  9  5  6  6  6  5     129

In [48]:
df2.loc["ColTotal", :] = df2.sum()
df2

            0     1     2     3     4     5     6     7  RowSum
0         0.0   8.0   3.0   6.0   3.0   3.0   7.0   8.0   114.0
1         0.0   0.0   8.0   9.0   3.0   7.0   2.0   3.0    96.0
2         6.0   5.0   0.0   4.0   8.0   6.0   4.0   1.0   102.0
3         1.0   5.0   9.0   5.0   6.0   6.0   6.0   5.0   129.0
ColTotal  7.0  18.0  20.0  24.0  20.0  22.0  19.0  17.0   441.0

In [65]:
# 연습문제
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [82]:
round(titanic['age'].mean(),2)

29.7

In [83]:
t2 = titanic[titanic['sex'] == 'female']
round(t2['age'].mean(),2)

27.92

In [86]:
 round(titanic[titanic.sex == 'female'].age.mean(),2)

27.92

In [87]:
round(titanic['age'].groupby(titanic['sex']).mean(),2)

sex
female    27.92
male      30.73
Name: age, dtype: float64

In [89]:
t3 = titanic[(titanic['sex'] == 'female') & (titanic['class'] == 'First')]
round(t3['age'].mean(),2)

34.61

In [81]:
round(titanic['age'].groupby([titanic['sex'],titanic['class']]).mean(),2)

sex     class
female  First     34.61
        Second    28.72
        Third     21.75
male    First     41.28
        Second    30.74
        Third     26.51
Name: age, dtype: float64

#### apply 변환

In [92]:
df3 = pd.DataFrame({
    'A' : [1, 3, 4, 3, 4],
    'B' : [2, 3, 1, 2, 3],
    'C' : [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [93]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [94]:
df3.apply(lambda x: x.max() - x.min(), axis = 1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [95]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [96]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [99]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20 else 'child', axis = 1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

#### fillna 메서드

In [100]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [106]:
t4 = titanic['age'].fillna(titanic['age'].mean())
t4

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

#### astype 메서드

In [107]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [122]:
titanic['category2'] = titanic['sex'] + titanic['age'].astype(int).astype(str)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,category2
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male22
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female38
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female26
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female35
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male27
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,female19
888,0,3,female,30,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,female30
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male26
890,0,3,male,32,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male32

#### 실수 값을 카테고리 값으로 변환

In [5]:
ages = [0, 1, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]

In [6]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels = labels)
cats

[NaN, NaN, 미성년자, 미성년자, 청년, ..., 장년, 미성년자, 중년, 중년, 노년]
Length: 13
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [7]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [8]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [9]:
cats.codes

array([-1, -1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2,  4], dtype=int8)

In [10]:
df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
df4

    ages age_cat
0      0     NaN
1      1     NaN
2      2    미성년자
3     10    미성년자
4     21      청년
5     23      청년
6     37      중년
7     31      중년
8     61      장년
9     20    미성년자
10    41      중년
11    32      중년
12   100      노년

In [11]:
df4.age_cat.astype(str) + df4.ages.astype(str)

0       nan0
1       nan1
2      미성년자2
3     미성년자10
4       청년21
5       청년23
6       중년37
7       중년31
8       장년61
9     미성년자20
10      중년41
11      중년32
12     노년100
dtype: object

In [12]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

[Q1, Q2, Q1, Q4, Q1, ..., Q3, Q3, Q4, Q3, Q4]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [13]:
pd.value_counts(cats)

Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64